# SculptingSingleLineLoopLiesOnAxis Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..SculptingSingleLineLoopLiesOnAxis Property
BuiltInFailures..::..SketchFailures Class See Also
---
The highlighted lines lie on the axis.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SculptingSingleLineLoopLiesOnAxis { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SculptingSingleLineLoopLiesOnAxis As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SculptingSingleLineLoopLiesOnAxis {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace